package alishev;

public class Access {
    public static void main(String[] args) {
        // public публичный, общедоступный класс или член класса. Поля и методы, объявленные с модификатором public,
        // видны другим классам из текущего пакета и из внешних пакетов.

        // private закрытый класс или член класса, противоположность модификатору public. Закрытый класс или член
        // класса доступен только из кода в том же классе.

        // default Отсутствие модификатора у поля или метода класса предполагает применение к нему модификатора по
        // умолчанию. Такие поля или методы видны всем классам в текущем пакете.

        // protected такой класс или член класса доступен из любого места в текущем классе или пакете или в
        // производных классах, даже если они находятся в других пакетах
    }
}
